"{\n    \"names of modules\": [\n        \"\",\n        \"Year 1\",\n        \"\",\n        \"Year 2\",\n        \"\",\n        \"Year 3\"\n    ],\n    \"modules\": [\n        \"About the Course\\nDo you love robots? Enjoy putting things together by hand? If your answer is yes, then you should take up our Diploma in Robotics & Mechatronics course, which combines mechanical, electronics and computing engineering.\\n\\nLearn how to build your own robots and gadgets as you pick up the basics of engineering and programming. Plus, you can choose to specialise in areas such as automation and robotics, wafer fabrication, aerospace or biomedical engineering.\\nThis diploma is for you if\\u2026\\nYou are fascinated by intelligent robots and are keen to integrate technologies to create high-tech devices. \\n     \",\n        \"Core Modules\\nAlgebra\\nCalculus\\nEffective Communication Skills\\nElectrical Principles\\nEngineering Drawing & Modelling\\nEngineering Exploration Project\\nFundamentals of Innovation and Enterprise\\nFundamentals of Mechanics\\nIntroduction to Engineering\\nMaterials Technology\\nProgramming\\nThermofluids\\nWorkplace Digital Skills\\nGeneral Studies\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"\",\n        \"The training of the Robotics & Mechatronics course obtained from the multi-disciplinary nature will add versatility to the graduates' capabilities. They will be able to adapt flexibly to a wide range of industries, and make contributions in developing new technologies and pioneering new approaches in production.\\nEngineering graduates from NYP will also be able to upgrade their knowledge and skills by pursuing their studies in local or overseas universities.\",\n        \"NYP\\u2019s Diploma in Robotics & Mechatronics also opens doors for you to further your education in many local and overseas universities. Our graduates have pursued degrees at:\\nNanyang Technological University\\nBachelor of Mechanical Engineering\\nBachelor of Electrical & Electronic Engineering\\nBachelor of Materials Engineering\\nNational University of Singapore\\nBachelor of Engineering (Electrical Engineering)\\nBachelor of Engineering (Computer Engineering)\\nBachelor of Computing\\nSingapore Institute of Technology\\nBachelor of Eng (Hons) Mechatronics\\nBachelor of Eng (Hons) Mechanical Design and Manufacturing Engineering\\nBachelor of Hotel Administration\"\n    ]\n}"