{
 "fullTimeCourses": [
  {
   "name": "Diploma in Robotics & Mechatronics",
   "about the course": "About the Course Do you love robots? Enjoy putting things together by hand? If your answer is yes, then you should take up our Diploma in Robotics & Mechatronics course, which combines mechanical, electronics and computing engineering.\n\nLearn how to build your own robots and gadgets as you pick up the basics of engineering and programming. Plus, you can choose to specialise in areas such as automation and robotics, wafer fabrication, aerospace or biomedical engineering. This diploma is for you if… You are fascinated by intelligent robots and are keen to integrate technologies to create high-tech devices.",
   "years": 
    {
     "year": "Year 1",
     "core modules": [
      {
       "title": [
        "Algebra",
        "Calculus",
        "Effective Communication Skills",
        "Electrical Principles",
        "Engineering Drawing & Modelling",
        "Engineering Exploration Project",
        "Fundamentals of Innovation and Enterprise",
        "Fundamentals of Mechanics",
        "Introduction to Engineering",
        "Materials Technology",
        "Programming",
        "Thermofluids",
        "Workplace Digital Skills",
        "General Studies"
       ],
       "hours": [
        "60 hours",
        "60 hours",
        "30 hours",
        "60 hours",
        "60 hours",
        "30 hours",
        "30 hours",
        "60 hrs",
        "60 hours",
        "60 hours",
        "60 hours",
        "60 hours",
        "30 hours"
       ],
       "description": [
        "This module provides learners with the basic mathematical principles and tools necessary to build their engineering foundation. It will enable them to apply mathematical methods, tools and notations proficiently in the analysis and solution of engineering problems. Topics covered include mathematical functions (polynomials, exponential, logarithms, step functions and trigonometry), commonly used in engineering complex numbers, determinants, matrices and vectors.",
        "This foundation module provides learners with the essential knowledge in calculus. This module helps learners in building skills for solving engineering problems encountered in their course of study. Topics include differentiation and integration of commonly used functions in engineering applications.",
        "Communicating well is a vital life skill, benefitting all aspects of our lives from professional life to social gatherings. It is thus important to be proficient in both written and oral communication. This module will enable learners to communicate effectively in different settings and on different collaborative platforms. There will be opportunities to practise and deliver various types of presentations, to learn to competently handle questions, and to effectively incorporate verbal and non-verbal elements when speaking. Learners will also acquire media and information literacy and be able to produce clearly written and well-structured reports and proposals, following standard citation and referencing guidelines.",
        "This module covers electrical fundamentals and their applications in electrical and electronic circuits. Topics covered include principles of electricity, power sources, resistive, capacitive and inductive circuits. Learners will need this knowledge to analyze, interpret and solve engineering problems.",
        "This module provides learners with the knowledge and skills to model the engineering parts and interpret drawings that are derived from the 3D models. Topics covered include orthographic projection, sectional views, assembly drawing, geometric dimensioning and tolerancing. This module will provide learners with the necessary skills in communicating ideas and concepts through engineering drawings, which is one of the necessary and critical skills needed in the design process.",
        "This module aims to develop learners’ innovative and enterprising skills while developing creative and technically robust solutions to real-world challenges. Learners will be able to effectively relate design thinking in the process of exploring innovative and enterprising solutions addressing the real needs that will bring about positive social change.",
        "Learners will develop attributes that are pervasive and synonymous with being innovative and enterprising for career and life. Through this module learners will develop positive practices when working with data, propose ideas using user-centric approaches and design processes, determine and locate resources, and leverage collaborative practices to formulate solutions.",
        "This module provides learners with the fundamentals of engineering mechanics.  Topics covered include Newton laws, statics of rigid bodies, moment of inertia and bending moments. Fundamentals in dynamics that include kinematics and kinetics of particles will also covered in this module. Learners will acquire fundamental engineering competence to understand and perform engineering-related activities related to statics and dynamics.",
        "This module introduces learners to different engineering disciplines by focusing on the application of relevant core engineering disciplines. Topics covered include roles and responsibilities of an engineer, ethics, and sustainability.  Learners will engage in the practice of engineering through the process of conceiving, designing, and implementing solutions to engineering problems, individually and in teams.  Through this, learners will also be able to hone their creative thinking and problem-solving skills, build synergistic teamwork and enhance their communication skills.",
        "This module covers the important properties and applications of engineering materials, including ferrous and non-ferrous metals, polymers, composites, and ceramics.  Learners are also exposed to various material properties tests and characterization, material processing methods and different material failure modes. This module serves as a foundation to enable learners to select appropriate materials for specific engineering applications.",
        "The practice-oriented module introduces learners to software development methodology. The learners will learn about problem-analysis, problem-solving techniques and develop essential programming skills. The learners will be able to create flowcharts, develop algorithms, write structured programs, test and debug programs.",
        "This module introduces the concepts of heat, fundamentals of thermodynamics, and fluid mechanics. Topics covered include temperature, heat capacities, latent heat, heat transfer and the ideal gas law, first laws of thermodynamics, the properties of fluids, the concepts and basic equations of fluid statics, and fluid flow. This module will enable learners to utilize their knowledge to analyse and solve problems relating to heat, heat transfer, ideal gases, fluid statics and fluids in motion.",
        "This module enables learners to use word processing software to create, modify and style document/report effectively and efficiently. Learners will use spreadsheets to manage, organise and model data as well as to perform analysis and report generation. Creation of customised, dynamic and multimedia-style presentations using software tools will also be covered. Through hands-on practices, learners will gain these skills and apply them in project work in preparation for the digital workplace.",
        "To provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation. To learn more about the GSMs offered, click here"
       ]
      }
     ]
    }
  }
 ]
}