{
 "fullTimeCourses": [
  {
   "name": "Diploma in Engineering with Business",
   "about the course": "About the Course Are you an inventor at heart? Do you see yourself starting your own technology business? Our Diploma in Engineering with Business marries engineering and business concepts. You’ll learn a wide range of subjects, including engineering technology, business analytics and planning and project and operations management.",
   "years": [
    {
     "year": "Year 1",
     "core modules": [
      {
       "title": "\ntitle\nAlgebra\nCalculus\nEffective Communication Skills\nElectrical Principles\nEngineering Drawing & Modelling\nEngineering Exploration Project\nFundamentals of Innovation & Enterprise\nFundamentals of Mechanics\nIntroduction to Engineering\nMaterials Technology\nProgramming\nThermofluids\nWorkplace Digital Skills\nGeneral Studies",
       "hours": "\nhours\n60 hours\n60 hours\n30 Hours\n60 Hours\n60 Hours\n30 hours\n30 hours\n60 hours\n60 hours\n60 hours\n60 hours\n60 hours\n30 hours",
       "description": "\ndescription\nThis module provides learners with the basic mathematical principles and tools necessary to build their engineering foundation. It will enable them to apply mathematical methods, tools and notations proficiently in the analysis and solution of engineering problems. Topics covered include mathematical functions (polynomials, exponential, logarithms, step functions and trigonometry), commonly used in engineering complex numbers, determinants, matrices and vectors.\nThrough this foundation module, learners will study essential knowledge in calculus and acquire skills for solving engineering problems encountered in their course of study. Topics include differentiation and integration of commonly used functions in engineering applications.\nCommunicating well is a vital life skill, benefitting all aspects of our lives from professional life to social gatherings. It is thus important to be proficient in both written and oral communication. This module will enable learners to communicate effectively in different settings and on different collaborative platforms. There will be opportunities to practise and deliver various types of presentations, to learn to competently handle questions, and to effectively incorporate verbal and non-verbal elements when speaking. Learners will also acquire media and information literacy and be able to produce clearly written and well-structured reports and proposals, following standard citation and referencing guidelines.\nThis module covers electrical fundamentals and their applications in electrical and electronic circuits. Topics covered include principles of electricity, power sources, resistive, capacitive and inductive circuits. Learners will apply this knowledge to analyze, interpret and solve engineering problems.\nIn this module, learners will gain knowledge and skills to model the engineering parts and interpret drawings that are derived from the 3D models. Topics covered include orthographic projection, sectional views, assembly drawing, geometric dimensioning and tolerancing. Learners will acquire the necessary skills in communicating ideas and concepts through engineering drawings, which is one of the necessary and critical skills needed in the design process.\nIn this module, learners will be engaged in a systematic process of design thinking. Through this process, they will acquire innovative and enterprising skills to develop creative and technically robust solutions to real-world challenges.\nThis module provides learners with the fundamentals of engineering mechanics. Topics covered include Newton laws, statics of rigid bodies, moment of inertia and bending moments. Fundamentals in dynamics that include kinematics and kinetics of particles will also be covered in this module. Learners will acquire fundamental engineering competency to understand and perform engineering-related activities related to statics and dynamics.\nIn this module, learners are exposed to different engineering disciplines by focusing on the application of relevant core engineering disciplines. Topics covered include roles and responsibilities of an engineer, ethics, and sustainability. Learners will engage in the practice of engineering through the process of conceiving, designing, and implementing solutions to engineering problems, individually and in teams. Through this, they will also be able to hone their creative thinking and problem-solving skills, build synergistic teamwork and enhance their communication skills.\nIn this module, learners will acquire knowledge of properties and applications of engineering materials, including ferrous and non-ferrous metals, polymers, composites, and ceramics. Learners are exposed to various material properties tests and characterization, material processing methods and different material failure modes. Learners will be able to select appropriate materials for specific engineering applications.\nThe practice-oriented module introduces learners to software development methodology. Learners will study problem-analysis and problem-solving techniques to develop essential programming skills. They will be able to create flowcharts, develop algorithms, write structured programs, test and debug programs.\nThis module introduces the concepts of heat, fundamentals of thermodynamics, and fluid mechanics. Topics covered include temperature, heat capacities, latent heat, heat transfer and the ideal gas law, first laws of thermodynamics, the properties of fluids, the concepts and basic equations of fluid statics, and fluid flow. Learners will apply their knowledge to analyse and solve problems relating to heat, heat transfer, ideal gases, fluid statics and fluids in motion.\nIn this module, learners will use word processing software to create, modify and style document/report effectively and efficiently. Learners will use spreadsheets to manage, organise and model data as well as to perform analysis and report generation. Creation of customised, dynamic and multimedia-style presentations using software tools will also be covered. Learners will gain and apply these skills through hands-on practices in preparation for the digital workplace.\nTo provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation. To learn more about the GSMs offered, click here"
      }
     ]
    },
    {
     "year": "Year 2",
     "core modules": [
      {
       "title": "\ntitle\nAnalogues & Digital Electronics\nBusiness Management\nCommunication and Personal Branding\nDifferential Equations & Series\nDigital Marketing Principles\nEngineering Economics\nEnterprise Resource Planning\nFinancial and Management Accounting\nIntegrated Project – Ideation\nIntegrated Project – Realisation\nMechanical Design\nMechanics – Dynamics\nStatistics and Data Analytics\nGeneral Studies",
       "hours": "\nhours\n60 hours\n60 hours\n30 hours\n60 hours\n60 hours\n60 hours\n30 hours\n60 hours\n30 hours\n30 hours\n60 hours\n60 hours\n60 hours",
       "description": "\ndescription\nThis module provides learners with the knowledge of the characteristics of electronics devices and their applications such as PN junction, Zener diodes, transistors and operational amplifiers. The module will also cover functions of basic logic devices and their applications. Learners will be able to apply the theory to design and analyze analogue and digital circuit. This module provides the foundation for learner to apply the basic knowledge of analogue and digital electronics for product design.\nThis module covers the basic knowledge on management principles, skills and business management processes. This module will train students to apply the management knowledge in the areas of planning, organising, leading and controlling an organisation.\nIn today’s competitive environment, a strong personal brand sets one apart from others. In this module, learners will develop techniques to impress and persuade others to accept their ideas. They will also learn how to communicate effectively over e-mail. To support their job search, learners will use digital portfolios to showcase their abilities, as well as gain the knowledge and skills to promote their capabilities in their cover letters and resumes. They will also acquire skills to project themselves positively and for performing well at interviews.\nThis module provides learners with the knowledge of solving ordinary differential equations and representing periodic functions in terms of Fourier series. The learners will be able to select and use appropriate models and techniques to solve engineering related problems. The main topics covered include first-order and second-order homogenous differential equations, Fourier series and its application.\nThis module provides learners with a basic understanding of marketing fundamentals in the digital marketing space. Learners will first learn the marketing concepts and principles in relation to customer behaviour and target marketing in consumer and business marketing. This knowledge is then expanded with the introduction of various digital marketing technologies including social media marketing, digital analytics and customer relationship management. This module provides the foundation for learners to apply the elements of marketing mix and the 4 Ps - product, place, promotion and price, to effectively navigate the digital marketing space.\nThis module aims to equip learners with fundamental economic principles, theories and concepts that allow learners to apply in the engineering context. Coverage of this module includes the price mechanism and its role in resource allocation in the product and factor markets, objectives of firms and how they operate and make price and output decisions, as well as comparison of firms’ behaviour in different market structures on the basis of efficiency, equity and innovation. Learners will also be introduced to key indicators of economic performance and various macroeconomic policies. Learners will develop the ability to use the tools of economic reasoning to explain, analyze and evaluate the project costing decisions based on various economic situations and issues.\nThis module introduces to learners the role of IT systems in logistics functions by covering the various logistics order fulfilment processes performed by Enterprise Resource Planning (ERP) systems. These systems integrate information and work flows across a company's various business functions. The learners will be exposed to industry practices by learning and applying industry-leading software.\nThis module will introduce learners to financial and management accounting concepts and principles. Learners will be able to apply basic costing concepts and financial techniques to analyze and evaluate capital investment projects. The module also covers preparation of management reports and accounts to provide financial and statistical information required by managers within the organization to make day-to- day and short-term decisions.\nThis module provides an understanding of human-centered design (HCD) approaches for innovation in technologies by considering the effect technologies have on people and society when human interacts with products and processes. The learners will learn to conduct needs analysis using systematic inquiry and identify the customer’s pain points based on the HCD approaches such as Design Thinking, User Experience Design and Universal Design. At the end of the module, the learners will be able to demonstrate an understanding of human behaviour and his environment, define, develop and effectively communicate their design solutions using a low fidelity prototype.\nIn this module, learners will realize their solutions by designing and implementing the mechanisms, incorporating the electronics element and the programme as required for the safe functioning of the product. The learner will incorporate the universal design and design for assembly considerations to optimize design form based on anthropometry data. At the end of the module, the learners will be able to test, evaluate and refine a prototype for production.\nThis module introduces the learners to the fundamental concepts and considerations of mechanical design and the design of machine elements. Topics covered include Engineering Design Process, Fits and Tolerances, Drive Elements, Shaft, Keys & Couplings, Bearing, Cams and Stress Analysis. The module will provide learners with the necessary knowledge pertinent to primary mechanical system design, as well as Design for Additive Manufacturing.\nThis module covers practical and complex mechanical analysis. It provides an overview of the various concepts of dynamics of particles and physical bodies. This module provides the foundation for learners to analyse and utilise their knowledge to solve real-life problems related to engineering dynamics.\nThis module provides learners with the essential concepts of probability and statistics and apply the concepts in solving data analytics problems. The topics covered include the probability, probability distributions, sampling distributions, linear correlation and regression. The module also introduces the various stages in a data analytics lifecycle, which includes acquisition, preparation, processing and modelling, to the learners. Based on the statistical knowledge, the learners will be able to perform descriptive analytics and simple predictive analytics using data analytics tools.\nTo provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation. To learn more about the GSMs offered, click here"
      }
     ]
    },
    {
     "year": "Year 3",
     "modules": [
      {
       "core modules": [
        {
         "title": "\ntitle\nArtificial Intelligence in Business\nIntegrated Project – Entrepreneurship\nOperations Management\nProject Engineering and Management\nGeneral Studies",
         "hours": "\nhours\n60 hours\n30 hours\n60 hours\n60 hours",
         "description": "\ndescription\nThis module provides learners with the essential concepts of Artificial Intelligence (AI) technologies that are used in business and engineering solutions to enhance the efficacy of business strategy. The learners will be able to demonstrate an understanding of the implications of AI in automating business processes and gaining insight through data analytics. AI algorithms which are used to create predictive models will also be introduced to the learners. These algorithms include regressions, classification and time-series prediction.\nThis module allows learners to integrate and apply knowledge and tools learned through the preparation and presentation of a business plan. The learners will be involved in activities that help them bring their products to the market. This module provides the foundation for learners to conduct an environmental research and analysis and develop business models to translate entrepreneurial ideas into a business plan.\nThis module provides learners with the knowledge in the functional area of business that is concerned with the production of goods and services. In conjunction with other functional areas, it also deals with the management of resources (inputs) and the distribution of finished goods and services to customers (outputs) in order to achieve optimal mix by varying the input and output parameters using a simulation model. At the end of this module, learners will be able to demonstrate an understanding of the operation strategy, design the product and process, plan and schedule resources, manage and simulate the supply chain that are required to manage day-to-day operations, and make vital decisions in an organisation.\nThis module focuses on both theoretical and practical aspects in project management. It aims to provide a solid foundation for learners to be knowledgeable on the subject and become effective project team members and potentially project managers. This module covers various knowledge areas and processes throughout the lifecycle of a project including defining, planning, executing, and closing phases.\nTo provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation."
        }
       ],
       "elective modules": [
        {
         "title": "title\nBusiness Process Optimisation & Analytics\nGlobal Supply Chain Management\nProduct Design & Evaluation\nProduct Lifecycle Management",
         "hours": "hours\n60 hours\n60 hours\n60 hours\n60 hours",
         "description": "description\nThis module covers business process optimization, business analytics and their importance to the overall business performance and strategy. Topics include process modelling techniques, business process optimization concepts and the analysis of business data using intelligent tools. This module provides the foundation for learner to demonstrate understanding of process modelling, analysing and streamlining of business data and processes.\nThis module provides learners the key concepts in supply chain management (SCM). Learners will learn how SCM is enabled through IT, and to be an integral part of strategy and operations management in the logistics, retail, services and manufacturing industries. The focus will be on global supply chain strategies for the integration of supply chain components into a coordinated system to enhance service level and reduce system-wide cost.\nThis module aims to equip learners with the fundamental of product design, covering the design process, product types, product evaluation and the manufacturing methods. Learners will learn the importance of design for environment and sustainability, design for manufacturability, design for assembly and how these concepts can be integrated into the product design. Learners will be able to apply the knowledge learned to design new product using 3D computer-assisted drafting and design system (CADD).\nThis module provides a management approach in managing a product lifecycle and its impact on the product supply chain. This module provides the foundation for learner to demonstrate an understanding of Product Lifecyle Management (PLM) information and digital flow in order to make information-driven decisions at every phase of the product lifecycle.\nFinal-year students will also have the opportunity to undertake a full-time project and participate in a local or overseas internship programme for one full semester."
        }
       ]
      }
     ]
    }
   ]
  }
 ],
 "career Prospects": "Career Prospects\n\nAs a graduate of this diploma, you can expect job opportunities in both engineering and business. Our students from this diploma have received job offers in engineering, banking and management from industry leaders like Siemens, JP Morgan and Olympus. Enjoy a rewarding career in…\n\nBusiness planning and development\nProject planning and management\nProduct design and development\nLogistics and supply chain management\nOperations management\nResearch and development\nBusiness analytics\n\n\n\nOr, stand out from the crowd by becoming a technopreneur or intrapreneur!",
 "further Studies": "Further Studies\n\nNYP’s Diploma in Engineering with Business also enables you to pursue further studies with good advanced standing in relevant degree courses at reputable universities in Singapore, the UK, Australia, the US, Canada and New Zealand.\nYou can apply for engineering or business degree programmes with the possibility of direct admission to the second year of study in many local and overseas universities. Our graduates have pursued degrees at:\n \nNanyang Technological University\nMechanical Engineering, Aerospace Engineering, Civil Engineering, Materials Engineering, Electrical and Electronic Engineering, Environmental Engineering, Bioengineering, Maritime Studies, Mathematical Sciences and Finance, Renaissance Engineering, Physics, Science, Economics, Business, Accountancy and Business, Financial Engineering. (see details)\n \nNational University of Singapore\nScience (Physics), Electrical Engineering, Mechanical Engineering, Architecture,  Arts & Social Sciences,  Business Administration, Business Administration (Accountancy),  Business Administration and Communications & New Media, Computer Science Courses,  Information Security,  Information Systems,  Industrial Design,  Project & Facilities Management\n \nSingapore Management University\nBusiness Management, Information Systems, Accountancy\n \nSingapore University of Technology and Design\nArchitecture and Sustainable Design, Engineering Product Development, Engineering Systems and Design, Information Systems Technology and Design\n \nSingapore Institute of Technology\nAll engineering and business courses\n \nUniversity of South Australia\nYou can complete a business degree program in 1.5 years.",
 "contact Us": {
  "course Manager": {
   "name": "Dr. Ang Wei Sin",
   "telephone Number": "(65) 6550 0954",
   "email": "ang_wei_sin@nyp.edu.sg"
  },
  "course Coordinator": [
   {
    "name": "Mr. Zulkifli Mohd Din",
    "telephone Number": "6550-0944",
    "email": "zulkifli_mohddin@nyp.edu.sg"
   }
  ]
 }
}