{
 "fullTimeCourses": [
  {
   "name": "Diploma in Robotics & Mechatronics",
   "about the course": "About the Course Do you love robots? Enjoy putting things together by hand? If your answer is yes, then you should take up our Diploma in Robotics & Mechatronics course, which combines mechanical, electronics and computing engineering.\n\nLearn how to build your own robots and gadgets as you pick up the basics of engineering and programming. Plus, you can choose to specialise in areas such as automation and robotics, wafer fabrication, aerospace or biomedical engineering. This diploma is for you if… You are fascinated by intelligent robots and are keen to integrate technologies to create high-tech devices.",
   "years": [
    {
     "year": "Year 1",
     "core modules": [
      {
       "title": "\ntitle\nAlgebra\nCalculus\nEffective Communication Skills\nElectrical Principles\nEngineering Drawing & Modelling\nEngineering Exploration Project\nFundamentals of Innovation and Enterprise\nFundamentals of Mechanics\nIntroduction to Engineering\nMaterials Technology\nProgramming\nThermofluids\nWorkplace Digital Skills\nGeneral Studies",
       "hours": "\nhours\n60 hours\n60 hours\n30 hours\n60 hours\n60 hours\n30 hours\n30 hours\n60 hrs\n60 hours\n60 hours\n60 hours\n60 hours\n30 hours",
       "description": "\ndescription\nThis module provides learners with the basic mathematical principles and tools necessary to build their engineering foundation. It will enable them to apply mathematical methods, tools and notations proficiently in the analysis and solution of engineering problems. Topics covered include mathematical functions (polynomials, exponential, logarithms, step functions and trigonometry), commonly used in engineering complex numbers, determinants, matrices and vectors.\nThis foundation module provides learners with the essential knowledge in calculus. This module helps learners in building skills for solving engineering problems encountered in their course of study. Topics include differentiation and integration of commonly used functions in engineering applications.\nCommunicating well is a vital life skill, benefitting all aspects of our lives from professional life to social gatherings. It is thus important to be proficient in both written and oral communication. This module will enable learners to communicate effectively in different settings and on different collaborative platforms. There will be opportunities to practise and deliver various types of presentations, to learn to competently handle questions, and to effectively incorporate verbal and non-verbal elements when speaking. Learners will also acquire media and information literacy and be able to produce clearly written and well-structured reports and proposals, following standard citation and referencing guidelines.\nThis module covers electrical fundamentals and their applications in electrical and electronic circuits. Topics covered include principles of electricity, power sources, resistive, capacitive and inductive circuits. Learners will need this knowledge to analyze, interpret and solve engineering problems.\nThis module provides learners with the knowledge and skills to model the engineering parts and interpret drawings that are derived from the 3D models. Topics covered include orthographic projection, sectional views, assembly drawing, geometric dimensioning and tolerancing. This module will provide learners with the necessary skills in communicating ideas and concepts through engineering drawings, which is one of the necessary and critical skills needed in the design process.\nThis module aims to develop learners’ innovative and enterprising skills while developing creative and technically robust solutions to real-world challenges. Learners will be able to effectively relate design thinking in the process of exploring innovative and enterprising solutions addressing the real needs that will bring about positive social change.\nLearners will develop attributes that are pervasive and synonymous with being innovative and enterprising for career and life. Through this module learners will develop positive practices when working with data, propose ideas using user-centric approaches and design processes, determine and locate resources, and leverage collaborative practices to formulate solutions.\nThis module provides learners with the fundamentals of engineering mechanics.\nTopics covered include Newton laws, statics of rigid bodies, moment of inertia and bending moments. Fundamentals in dynamics that include kinematics and kinetics of particles will also covered in this module. Learners will acquire fundamental engineering competence to understand and perform engineering-related activities related to statics and dynamics.\nThis module introduces learners to different engineering disciplines by focusing on the application of relevant core engineering disciplines. Topics covered include roles and responsibilities of an engineer, ethics, and sustainability.\nLearners will engage in the practice of engineering through the process of conceiving, designing, and implementing solutions to engineering problems, individually and in teams.\nThrough this, learners will also be able to hone their creative thinking and problem-solving skills, build synergistic teamwork and enhance their communication skills.\nThis module covers the important properties and applications of engineering materials, including ferrous and non-ferrous metals, polymers, composites, and ceramics.\nLearners are also exposed to various material properties tests and characterization, material processing methods and different material failure modes. This module serves as a foundation to enable learners to select appropriate materials for specific engineering applications.\nThe practice-oriented module introduces learners to software development methodology. The learners will learn about problem-analysis, problem-solving techniques and develop essential programming skills. The learners will be able to create flowcharts, develop algorithms, write structured programs, test and debug programs.\nThis module introduces the concepts of heat, fundamentals of thermodynamics, and fluid mechanics. Topics covered include temperature, heat capacities, latent heat, heat transfer and the ideal gas law, first laws of thermodynamics, the properties of fluids, the concepts and basic equations of fluid statics, and fluid flow. This module will enable learners to utilize their knowledge to analyse and solve problems relating to heat, heat transfer, ideal gases, fluid statics and fluids in motion.\nThis module enables learners to use word processing software to create, modify and style document/report effectively and efficiently. Learners will use spreadsheets to manage, organise and model data as well as to perform analysis and report generation. Creation of customised, dynamic and multimedia-style presentations using software tools will also be covered. Through hands-on practices, learners will gain these skills and apply them in project work in preparation for the digital workplace.\nTo provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation. To learn more about the GSMs offered, click here"
      }
     ]
    },
    {
     "year": "Year 2",
     "core modules": [
      {
       "title": "\ntitle\nAI Applications\nAnalogue & Digital Electronics\nAutomatic Control\nDevice Interfacing & Programming\nDifferential Equations & Series\nMechanical Design\nMicrocontroller Applications\nProbability & Statistics\nQuality Assurance\nRobotic Systems & Peripherals\nSemestral Projects\nSemestral Project 3\nSemestral Project 4\nGeneral Studies",
       "hours": "\nhours\n30 hours\n60 hours\n60 hours\n60 hours\n60 hrs\n60 hours\n60 hours\n60 hrs\n60 hours\n60 hours\n30 hours\n60 hours",
       "description": "\ndescription\nAI is pervasive in modern technology enabling new applications and features. Mechatronics systems and robotics too greatly benefit from AI. Some examples include improved human machine interaction, navigation, and object identification & manipulation. Learners will gain an understanding of basic concepts of Artificial Intelligence, different types of machine learning and deep learning fundamentals. Topics covered include data manipulation, search, regression, MLP, CNN and reinforcement learning. Learners will further apply these concepts to solve problems.\nThis module covers the structures and characteristics of various electronic devices such as rectifier diodes, special-purpose diodes, and bipolar junction transistors. ﻿Learners will learn the basic operating principles of these electronics devices and where they are commonly used.\nThis module aims to equip learners with knowledge on pneumatics, electrical control devices, sensors, I/O interfacing and programmable logic controller (PLC), GRAFCET and logic program development. The module introduces the fundamental concepts of automatic control system, the methodology of implementing combinational and sequential logic control. Learners will acquire skills in design, development and application of ladder logic program, GRAFCET and function blocks which are widely used in the industry to control the automation equipment or system.\nThis module introduces students to sensors and actuators, which are commonly used in mechatronic systems, and the interfacing techniques used for connecting them to a microprocessor/computer. Hands-on applications of these devices will also be provided. Upon completion of the module, learners will be able to demonstrate the techniques and skill used to integrate devices in realising a mechatronic system.\nThis module provides learners with the knowledge of solving ordinary differential equations and representing periodic functions in terms of Fourier series. The learners will be able to select and use appropriate models and techniques to solve engineering related problems. The main topics covered include first-order and second-order homogenous differential equations, Fourier series and its application.\nThis module covers the strength of materials and its application to machine elements and engineering design. It provides learners with fundamental knowledge in engineering design. This includes stress and strain analysis, limits and fits, sizing of drive elements such as shaft, gear, flexible drive and leadscrew, and the application of bearings. Design exercises are included to provide the students with hands-on experience in design. At the end of this module, they will be able to effectively contribute to the design of mechanisms.\nThis module introduces the application design and development process for an embedded microcontroller system. Learners will learn to develop microcontroller application programmes. Concepts covered in microcontroller programming are I/O programming, peripherals programming and interrupt handlings. Case studies will be used to illustrate the fundamental building blocks of a microcontroller system and how they are inter-related. Upon completion of this module, students will be able to demonstrate the use of various basic programming skills and knowledge of an embedded microcontroller system.\nThis module provides learners with the essential concepts of probability and statistics. The learners will be able to apply probability theory and statistics to analyse real life problems. The topics covered include the probability concepts, probability distributions (Binomial, Poisson and Normal), sampling distributions, estimating and testing of population mean, linear correlation and regression.\nThis module aims to introduce the fundamentals of quality assurance concepts and systems. It provides learners an understanding of quality system in the manufacturing environment. It encompasses sampling plans and control charts for monitoring of batch production. In addition, the module also provides learners with fundamental concepts in dimensional measurement. They will learn about some of the specialised instruments and techniques through hands-on practice. By the end of the module, learners will gain a firm understanding of good measurement practices.\nThis module is designed to provide learners with a sound knowledge of robotics technology. The module covers robot classification and anatomy, robot kinematics, control concept, robotic communication and programming, system peripherals, machine vision system and robotic safety. Upon completion of this module, learners will gain a basic understanding of the key aspects of robotics.\nThis module aims to develop learners’ innovative and enterprising mindset by providing them with experiences in self-initiated learning in innovation and enterprise. Learners will learn to recognise and relate the importance of innovation and enterprise through studying real-world examples around them, as well as a series of experiential exploration and research into varied technologies, products and industries.\nMechatronics systems are crucial to modern products and devices that have a specific purpose. Robots, automated production systems, consumer electronics and household appliances are examples of such systems. In this module, learners will interface various input and output devices to a programmable controller through a series of practical exercises. They will also acquire knowledge of wireless and Internet of Things (IoT) technology to link the controller to a cloud application. This will enable remote sensing, data aggregation, analysis, and control. In addition, learners will be able to integrate the components to design, develop and troubleshoot an IoT enabled robotics and mechatronics system according to a set of requirements.\nTo provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation. To learn more about the GSMs offered, click here"
      }
     ]
    },
    {
     "year": "Year 3",
     "elective programmes": [
      {
       "name": "Automation & Robotics Technology",
       "core modules": [
        {
         "title": "\ntitle\nAutomation Systems Design\nCommunication & Personal Branding\nMotion Control & Drives\nSemestral Project\nGeneral Studies",
         "hours": "\nhours\n60 hours\n30 hours\n60 hours\n60 hours",
         "description": "\ndescription\nThis module aims to provide essential concepts and principles to support the design process of automation systems. The module also aims to synthesize diverse engineering fundamentals including the use of robotic work cell and various types of layout in such systems. Various aspects of manufacturing systems/technologies and an overview of automation assembly systems will be covered in this module. The lectures are complemented with practical design sessions using 3D computer-assisted drafting and design system. Upon successfully completing this module, learners should be able to integrate the knowledge acquired from this module and other related engineering knowledge to perform design of automation systems.\nIn today’s competitive environment, a strong personal brand sets one apart from others. In this module, learners will develop techniques to impress and persuade others to accept their ideas. They will also learn how to communicate effectively over email. To support their job search, learners will use digital portfolios to showcase their abilities, as well as gain the knowledge and skills to promote their capabilities in their cover letters and resumes. They will also acquire skills to project themselves positively and for performing well at interviews.\nThis module equips learners with practical knowledge of motion control systems and the associated power electronics knowledge for drive applications. These drives are the prime movers of most mechatronics products and automation systems of today. At the end of the module, learners will be able to apply the knowledge gained to real-life engineering projects.\nThis module develops learners’ abilities in applying techniques, skills and knowledge learnt for new product design, development and product marketing. Learners are expected to present their solutions with a complete business plan, which includes, but is not restricted to, information gathering, market analysis, manufacturability, product usability, robustness of design and cost analysis. Upon completion of the module, learners will be able to demonstrate an understanding of the processes involved in new product design/development, cost analysis and product marketing.\nTo provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation."
        }
       ],
       "elective modules": [
        {
         "title": "title\nCommunication & Networking\nIntelligent Systems\nMechanisms Design & Simulation\nSystems & Control\nWafer Fabrication Processes",
         "hours": "hours\n60 hours\n60 hours\n60 hours\n60 hours\n60 hours",
         "description": "description\nThis module acquaints learners with the fundamentals of computer communications and networking, their protocols and operation. It also equips learners with sufficient practical knowledge in computer data networks and device communications that support shop-floor automation systems and solutions. At the end of the module, learners will be able to apply the knowledge and competence acquired in computer communications and local area networking to solve real-life engineering problems.\nThis module provides students with essential knowledge of data acquisition, signal processing and intelligent algorithms related to the industry to meet the needs for intelligent automation system. It uses AI techniques to develop solutions to design intelligent systems. Practical skills pertaining to these technologies will be emphasised in the laboratory to enhance the understanding of intelligent systems and how to realise these systems. In all, learners will gain competency in building control system/sub-system and in applying techniques for developing intelligent systems.\nThis module aims to equip learners with knowledge to select and design mechanisms for automated machines and equipment. Coverage includes fundamental design principles and design considerations of typical mechanisms. The focus is on the understanding of mechanism design principles and application of such knowledge in the development of automation devices and machines. Upon completion of the module, learners will be able to analyse, model and develop mechanisms to solve problems in the automation industry.\nThis module provides learners with the fundamental knowledge of control system. It includes the characteristics and modelling of physical system, basis of frequency and time domain analysis. The module also covers feedback control system, stability study and PID control. Upon completion of this module, learners will be able to appreciate and apply their knowledge to solve real-life problems related to feedback control systems.\nThis module aims to equip learners with the fundamental principles pertaining to semiconductor devices. It includes atomic physics, semiconductor materials and the physics of semiconductor devices. Learners will also learn about semiconductor assembly processes, failure analysis techniques, reliability and testing methods."
        }
       ]
      },
      {
       "name": "Wafer Fabrication Technology",
       "core modules": [
        {
         "title": "\ntitle\nCommunication & Personal Branding\nSemestral Project\nSemiconductor Technology\nWafer Fabrication Processes\nGeneral Studies",
         "hours": "\nhours\n30 hours\n60 hours\n60 hours\n60 hours",
         "description": "\ndescription\nIn today’s competitive environment, a strong personal brand sets one apart from others. In this module, learners will develop techniques to impress and persuade others to accept their ideas. They will also learn how to communicate effectively over email. To support their job search, learners will use digital portfolios to showcase their abilities, as well as gain the knowledge and skills to promote their capabilities in their cover letters and resumes. They will also acquire skills to project themselves positively and for performing well at interviews.\nThis module develops learners’ abilities in applying techniques, skills and knowledge learnt for new product design, development and product marketing. Learners are expected to present their solutions with a complete business plan, which includes, but is not restricted to, information gathering, market analysis, manufacturability, product usability, robustness of design and cost analysis. Upon completion of the module, learners will be able to demonstrate an understanding of the processes involved in new product design/development, cost analysis and product marketing.\nLearners should have some knowledge of basic engineering sciences, mathematics, electrical principles, electronics and electronic devices. Major topics covered include classification of cleanrooms, a study of major IC devices, parametric testing, failure analysis and reliability engineering. Practical skills pertaining to these topics will be realised in the laboratory to enhance the understanding of semiconductor technologies in a real manufacturing environment. At the end of the module, learners will be able to apply the knowledge that they have gained to real-life engineering problems involving parametric testing, failure analysis and reliability engineering.\nThis module aims to equip learners with the fundamental principles pertaining to semiconductor devices. It includes atomic physics, semiconductor materials and the physics of semiconductor devices. Learners will also learn about semiconductor assembly processes, failure analysis techniques, reliability and testing methods.\nTo provide you an all-rounded education, NYP offers General Studies Modules (GSMs). So besides taking modules related directly to your chosen diploma course, you will get exposed to areas beyond your usual field of study. Through a combination of prescribed and elective inter-disciplinary GSMs, you will gain interesting, practical knowledge that can be beneficial to you as you prepare for the world of work and life after graduation."
        }
       ],
       "elective modules": [
        {
         "title": "title\nCommunication & Networking\nElectronic Materials\nNanomaterials Science\nSystems & Control\nVacuum Technology & RF Plasma",
         "hours": "hours\n60 hours\n60 hours\n60 hours\n60 hours\n60 hours",
         "description": "description\nThis module acquaints learners with the fundamentals of computer communications and networking, their protocols and operation. It also equips students with sufficient practical knowledge in computer data networks and device communications that support shop-floor automation systems and solutions. At the end of the module, learners will be able to apply the knowledge and competence acquired in computer communications and local area networking to solve real-life engineering problems.\nThis module provides learners with essential knowledge and concepts of materials used in electronic applications. Learners are introduced to the physical principles of electronic conduction in materials, influences of composition and microstructure on electronic properties of materials, and applications of materials in electronic, magnetic and optical devices. Practical sessions will be conducted in the laboratory to enhance the understanding of the electronic materials and working principles of electronic devices. By the end of this module, learners will be able to analyse the electronic property of materials, describe the working principles and the structure of electronic devices such as diodes, light emitting diodes (LED), solar cells and transistors.\nThis module provides students with fundamental knowledge of materials at the nanoscale. Learners are introduced to the physics of nanotechnology. Topics covered include concepts of surface area, surface energy and structures, as well as their effects on material properties, and the common techniques to fabricate and characterise nanomaterials. Applications of important nanomaterials and their environmental impact will be discussed. Knowledge acquired by learners will be useful in the materials industry as well as in research laboratories.\nThis module provides learners with the fundamental knowledge of control system. It includes the characteristics and modelling of physical system, basis of frequency and time domain analysis. The module also covers feedback control system, stability study and PID control. Upon completion of this module, learners will be able to appreciate and apply their knowledge to solve real-life problems related to feedback control systems.\nThis module aims to develop learners with essential fundamental knowledge in vacuum technology applicable to wafer fabrication processes. Topics include fluid flow and pumping concepts, vacuum pumps and vacuum pressure measurement techniques, vacuum system design, vacuum leak detection methods and hardware components. Learners will also learn about RF plasma basics, impedance matching network and process parameter effects. In all, learners will appreciate the various vacuum and fluid flow concepts, the application of these concepts to vacuum equipment and techniques, as well as basic RF plasma technology.\nFinal-year students will also have the opportunity to undertake a full-time project and participate in a local or overseas internship programme for one full semester."
        }
       ]
      }
     ]
    }
   ]
  }
 ],
 "career Prospects": "Career Prospects\n\nThe training of the Robotics & Mechatronics course obtained from the multi-disciplinary nature will add versatility to the graduates' capabilities. They will be able to adapt flexibly to a wide range of industries, and make contributions in developing new technologies and pioneering new approaches in production.\nEngineering graduates from NYP will also be able to upgrade their knowledge and skills by pursuing their studies in local or overseas universities.",
 "further Studies": "Further Studies\n\nNYP’s Diploma in Robotics & Mechatronics also opens doors for you to further your education in many local and overseas universities. Our graduates have pursued degrees at:\n\nNanyang Technological University\nBachelor of Mechanical Engineering\nBachelor of Electrical & Electronic Engineering\nBachelor of Materials Engineering\n\n\nNational University of Singapore\nBachelor of Engineering (Electrical Engineering)\nBachelor of Engineering (Computer Engineering)\nBachelor of Computing\n\n\nSingapore Institute of Technology\nBachelor of Eng (Hons) Mechatronics\nBachelor of Eng (Hons) Mechanical Design and Manufacturing Engineering\nBachelor of Hotel Administration",
 "contact Us": {
  "course Manager": {
   "name": "Mr David Poh",
   "telephone Number": "(65) 6550 0893",
   "email": "David_Poh@nyp.edu.sg"
  },
  "course Coordinator": [
   {
    "name": "Mr Chor Khee San",
    "telephone Number": "(65) 6550 0927",
    "email": "CHOR_Khee_San@nyp.edu.sg"
   },
   {
    "name": "Mr Lee Kim Cheng",
    "telephone Number": "(65) 6550 0556",
    "email": "lee_kim_cheng@nyp.edu.sg"
   }
  ]
 }
}